## KNN Imputer

In [130]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.impute import KNNImputer,SimpleImputer
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [131]:
df = pd.read_csv('train.csv')[['Age','Pclass','Fare','Survived']]

In [132]:
df.head()

    Age  Pclass     Fare  Survived
0  22.0       3   7.2500         0
1  38.0       1  71.2833         1
2  26.0       3   7.9250         1
3  35.0       1  53.1000         1
4  35.0       3   8.0500         0

## Check missing value

In [134]:
df.isnull().mean() * 100

Age         19.86532
Pclass       0.00000
Fare         0.00000
Survived     0.00000
dtype: float64

## Define x & y

In [136]:
x = df.drop(columns=['Survived'])
y = df['Survived']

## Train Test Split

In [138]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=2)

In [139]:
x_train

      Age  Pclass      Fare
30   40.0       1   27.7208
10    4.0       3   16.7000
873  47.0       3    9.0000
182   9.0       3   31.3875
876  20.0       3    9.8458
..    ...     ...       ...
534  30.0       3    8.6625
584   NaN       3    8.7125
493  71.0       1   49.5042
527   NaN       1  221.7792
168   NaN       1   25.9250

[712 rows x 3 columns]

## Apply KNN Imputer

In [141]:
knn = KNNImputer(n_neighbors=2,weights='distance') ## accuracy change according neightbors value change
x_train_trf = knn.fit_transform(x_train)
x_test_trf = knn.transform(x_test)

## Convert in Data Frame

In [143]:
pd.DataFrame(x_train_trf,columns=x_train.columns)

           Age  Pclass      Fare
0    40.000000     1.0   27.7208
1     4.000000     3.0   16.7000
2    47.000000     3.0    9.0000
3     9.000000     3.0   31.3875
4    20.000000     3.0    9.8458
..         ...     ...       ...
707  30.000000     3.0    8.6625
708  25.838384     3.0    8.7125
709  71.000000     1.0   49.5042
710  28.000000     1.0  221.7792
711  49.795455     1.0   25.9250

[712 rows x 3 columns]

In [144]:
pd.DataFrame(x_train_trf,columns=x_train.columns).sample(10)

      Age  Pclass      Fare
272  24.0     3.0   24.1500
285  58.0     1.0  153.4625
239  34.5     3.0   24.1500
457  24.0     3.0    7.0500
680  62.0     2.0   10.5000
287  15.0     3.0    7.2292
5    30.0     2.0   13.0000
390  22.0     3.0    7.2500
538  29.0     2.0   27.7208
38   34.5     3.0   23.2500

## Apply Logistic Regression

In [146]:
lr = LogisticRegression()
lr.fit(x_train_trf,y_train)
y_pred = lr.predict(x_test_trf)
accuracy_score(y_test,y_pred)

0.7150837988826816